var WIDTH = 600;
var HEIGHT = 600;
onload=function(){
	
	var gameState = function(game){
		this.init = function(){

			if (typeof(主角数据)=='undefined') {//调试时使用
				主角数据 = {
					'内力上限':4000,
					'力道':3000000000,
					'医疗':80,
					'名':
					"行深",
					'姓'
					:
					"云",
					'姓名'
					:
					"云行深",
					'御剑'
					:
					11,
					'悟性'
					:
					49,
					'护体'
					:
					15,
					'拳掌'
					:
					100,
					'暗器'
					:
					7,
					'生命上限'
					:
					500,
					'用毒'
					:
					6,
					'福缘'
					:
					80,
					'解毒'
					:
					29,
					'身法'
					:
					22,'生命':500,'内力':4000,
					'声望':0,'银两':0,'经验':0,'学点':10,'等级':1,'秘籍':[
						{
							'名称':'华山心法',
							'数量':1
						},
					],'事件':[
						//{名称: "赏善罚恶令", 数量: 1},//需声望
						//{名称: "笑傲江湖谱", 数量: 1},//需要过衡阳刘正风金盆洗手事件听完刘曲演奏笑傲江湖曲
						//{名称: "黑木令", 数量: 1},//需要过襄阳蒙冤
						{名称: "关外白酒", 数量: 1},
						{名称: "犀角杯", 数量: 1},
						{名称: "葡萄酒", 数量: 1},
						{名称: "夜光杯", 数量: 1},
					],'丹药':[
						{'名称':'黑玉断续膏','数量':0},
						{'名称':'九花玉露丸','数量':0},
						{'名称':'九转熊蛇丸','数量':0},
						{'名称':'小还丹','数量':0},
						{'名称':'金创药','数量':0},
						{'名称':'玉真散','数量':0},
						{'名称':'莽牯朱蛤','数量':0},
						{'名称':'豹胎易筋丸','数量':0}
					],'装备':['铁剑','金蛇剑','','布衣','铁甲',''],//暗器 飞镖  生死符
					'已装备武器':'','已装备防具':'','已装备暗器':'','杀孽':0,'侠义':50,//分界线50
					'天赋':[],'打神仙':0,'拜神仙':0,'败给岳灵珊':0,'向岳不群请教武功':0,'少林思过':0,
				}
			}
			游戏数据 = base['o_base'];
			for(var k in playerData){
				游戏数据[0].主角[k] = playerData[k];
			}
			for(var k in 主角数据){
				游戏数据[0].主角[k] = 主角数据[k];
			}
			
		}
		
		this.create=function(){

			var dialog_UI = game.add.group();
			var bg = game.add.image(0,0,'map0001');
			bg.width = game.width;
			bg.height = game.height;
			var heads = game.add.group();//没必要限制个数 可以直接按照立绘组个数 不改了 重构代码时再写
			for (let i = 0; i < 5; i++) {
				var x = i<2?game.world.centerX - 100 * i - 100 : game.world.centerX + 100 * i - 200;
				head = heads.create(x,250,'');
				head.anchor.setTo(0.5);
				head.inputEnabled = true;
				head.events.onInputDown.add(function(){
					//console.log(this.name);
				},head);
			}
			var dialog_box = game.add.image(0,0,'dialog_UI');
			dialog_box.y = game.height - dialog_box.height;
			var dialog_box_head = game.add.image(0,0,'head0001');
			dialog_box_head.scale.setTo(-1,1);
			dialog_box_head.x -= dialog_box_head.width*1.15;
			dialog_box_head.y = game.height - dialog_box_head.height * 1.4;
			var dialog_box_name = game.add.text(0,0,'',{fill:'white',fontSize:21});
			dialog_box_name.x = dialog_box_head.x * 1.1;
			dialog_box_name.y = dialog_box.y * 1.03;
			var dialog_box_text = game.add.text(0,0,'',{fill:'black',fontSize:16});
			dialog_box_text.x = dialog_box_head.x * 1.1;
			dialog_box_text.y = dialog_box.y * 1.12;
			dialog_box_name.text = '云行深';
			dialog_box_text.text = '你个庸医！';
			// var dialog_box_option_1 = game.add.text(0,0,'',{fill:'black',fontSize:16});
			// dialog_box_option_1.x = dialog_box_head.x * 1.1;
			// dialog_box_option_1.y = dialog_box.y * 1.12;
			// var dialog_box_option_2 = game.add.text(0,0,'',{fill:'black',fontSize:16});
			// dialog_box_option_2.x = dialog_box_head.x * 1.1;
			// dialog_box_option_2.y = dialog_box.y * 1.18; // 1.12 1.18 1.24 三个选项的纵坐标
			// dialog_box_option_1.inputEnabled = true;
			// dialog_box_option_2.inputEnabled = true;
			var dialog_box_select = [];
			for(let i=0;i<5;i++){
				dialog_box_select[i] = game.add.text(dialog_box_head.x * 1.1,dialog_box.y * 1.105 + i * 16,i,{fill:'black',fontSize:16});
				dialog_box_select[i].inputEnabled = true;
				dialog_box_select[i].events.onInputDown.add(function(){
					if(剧情名称=='剧情_衡阳武馆馆主' && 场景索引==0){
						if(游戏数据[0].主角.银两<2&&i==0||游戏数据[0].主角.银两<10&&i==1||游戏数据[0].主角.银两<20&&i==2||游戏数据[0].主角.银两<5&&i==3){
							场景索引 = 6;
							场景切换();
							return false;
						}
						if(i==3){
							playerData.可用武学.拳[0].可用 = true;//习得形意拳
							主角数据['力道'] += 5;
							主角数据['身法'] += 8;
							主角数据['护体'] += 5;
							主角数据['拳掌'] += 5;
							主角数据['御剑'] += 5;
							主角数据['生命上限'] += 30;
							主角数据['内力上限'] += 15;
							主角数据['生命'] = 主角数据['生命上限'];
							主角数据['内力'] = 主角数据['内力上限'];
						}
					}
					if(剧情名称=='剧情_衡阳武馆馆主' && 场景索引==1){
						if(游戏数据[0].主角.银两<2&&i==0||游戏数据[0].主角.银两<10&&i==1||游戏数据[0].主角.银两<20&&i==2){
							场景索引 = 6;
							场景切换();
							return false;
						}
					}
					if(剧情名称=='剧情_衡阳医馆大夫' && 场景索引==0){
						console.log(游戏数据[0].主角.银两);
						if(游戏数据[0].主角.银两<100&&i==0||游戏数据[0].主角.银两<5&&i==1||游戏数据[0].主角.银两<15&&i==2){
							场景索引 = 4;
							场景切换();
							return false;
						}
					}
					if(剧情名称=='剧情_衡阳客栈店小二' && 场景索引==5){
						if(i==0 && 游戏数据[0].主角.银两<30){
							场景索引 = 6;
							场景切换();
							return false;
						}else{
							if(游戏数据[0].主角.声望 < 800){
								游戏数据[0].主角.银两 -= 30;
							}
						}
					}
					if(剧情名称=='剧情_襄阳妓院小宝货郎' && 场景索引==11){//提供选择的场景索引
						console.log(游戏数据[0].主角.银两);
						if(游戏数据[0].主角.银两<200&&i==0){ //i==选项索引
							场景索引 = 14;
							场景切换();
							return false;
						}
					}
					console.log(`剧情名称${剧情名称}，场景索引${场景索引}：${i}`);
					var 跳转 = 对话框跳转[i];
					//console.log(跳转);
					剧情名称 = 跳转.剧情名称;
					场景索引 = 跳转.场景索引;
					场景切换();
					对话框存在选项 = false;
				},this);
			}
			dialog_UI.add(bg);
			dialog_UI.add(heads);
			dialog_UI.add(dialog_box);
			dialog_UI.add(dialog_box_head);
			dialog_UI.add(dialog_box_name);
			dialog_UI.add(dialog_box_text);
			dialog_UI.alpha = 0;
			dialog_box.inputEnabled = true;
			dialog_box.events.onInputDown.add(function(){
				if(typeof(不可跳转)!=='undefined'){
					if(不可跳转){
						return false;
					}
					console.log(this.不可跳转);
				}
				if (对话框存在选项) {
					return false;
				}
				场景索引++;
				场景切换();
			},this);
			// 这里的索引为0 即剧情开始  测试索引从32开始 省得一直点点点
			场景切换 = function(){
				console.log(`${剧情名称}${场景索引}`);
				for (let i = 0; i < audios.length; i++) {//移除所有声音 //序列帧动画应与此同
					audios[i].destroy();	
				}
				for(let i=0;i<heads.length;i++){//隐藏所有头像
					heads.children[i].alpha = 0;
				}
				if(typeof(引导按钮组)!=='undefined'){
					if(引导按钮组.length>0){
						for (let i = 0; i < 引导按钮组.length; i++) {
							引导按钮组.destroy();
						}
					}
				}

				if(剧情名称=='剧情_主角死亡'){
					if(所处场景=='剧情_昆仑派'){
						if(游戏数据[0].主角.福缘>=80){
							剧情名称 = '剧情_昆仑仙境_救猿';
							场景索引 = 0;
							场景切换();
							return false;
						}
					}
					game.state.start('death');
					return false;
				}
				if(剧情名称=='剧情_襄阳衙门'&&场景索引==12){
					襄阳衙门事件 = true;
				}
				if(剧情名称=='剧情_剑冢_救雕'){
					剑冢救雕事件 = true;
				}
				if(
					剧情名称=='剧情_主地图'||
					剧情名称=='剧情_衡阳客栈'||
					剧情名称=='剧情_襄阳妓院'||
					剧情名称=='剧情_侠客岛'||
					剧情名称=='剧情_剑冢2'||
					剧情名称=='剧情_昆仑派'||
					剧情名称=='剧情_昆仑仙境'||
					剧情名称=='剧情_破庙_炼毒'||
					剧情名称=='剧情_华山派'||
					剧情名称=='剧情_华山派_思过崖'||
					剧情名称=='剧情_华山派_思过崖_终'||
					剧情名称=='剧情_武当派_导向'||
					剧情名称=='剧情_少林寺_导向'||
					剧情名称=='剧情_明教'||
					剧情名称=='剧情_黑木崖'
				){//提供休息的场景、事件场景
					所处场景  = 剧情名称;
				}
				if(剧情名称=='剧情_万劫谷_谷口'&&场景索引==6){
					if(破庙剧情线==0){
						场景索引 = 7;
					}else{
						场景索引 = 10;
					}
				}
				if(剧情名称=='剧情_破庙'&&场景索引==14){
					if(游戏数据[0].主角.门派=='无门派'){

					}else{
						场景索引 = 20;
					}
				}
				if(剧情名称=='剧情_无量山洞'&&场景索引==205){
					if(playerData.可用武学.内[2].可用){//存在武学 北冥神功 则拿不到秘籍
						场景索引 = 206;
					}
				}
				if(剧情名称=='剧情_天龙寺_鸠摩智'&&场景索引==10){
					if(playerData.可用武学.指[1].可用){//存在武学 一阳指 拿 六脉神剑 反之 拿 一阳指
					}else{
						场景索引 = 17;
					}
				}
				if(剧情名称=='剧情_侠客岛'){
					if(侠客岛剧情线==1){
						剧情名称  = '剧情_侠客岛_序';
					}
				}
				if(剧情名称=='剧情_侠客岛_序'&&场景索引==11){
					if(游戏数据[0].主角.侠义 < 50){
						场景索引 = 13;
					}
				}
				if(剧情名称=='剧情_神仙劫道'&&场景索引==5){
					if(游戏数据[0].主角.打神仙==19){//打神仙20次事件
						场景索引 = 0;
						剧情名称 = '剧情_打神仙20次';
					}
				}
				if(剧情名称=='剧情_华山之巅'){
					for (let i = 0; i < 游戏数据[0].主角.事件.length; i++) {
						if(游戏数据[0].主角.事件[i].名称 == '华山论剑贴'){
							剧情名称 = '剧情_华山论剑';
						}
					}
				}
				
				if(剧情名称=='剧情_黑木崖'){
					if(黑木崖剧情线==0){//不存在黑木令的情况下
						剧情名称  = '剧情_黑木崖_加入';
					}
					if(黑木崖剧情线==1){
                        kungfu['o_kungfu'].forEach(function(item){
                            if('铁掌'==item.名称){
								if(item.等级==10){
									剧情名称  = '剧情_黑木崖_晋升';
								}else{
									剧情名称  = '剧情_黑木崖_晋升';
									场景索引 = 5;
								}
                            }
                        });
					}
					if(黑木崖剧情线==0||黑木崖剧情线==1){
						for (let i = 0; i < 游戏数据[0].主角.事件.length; i++) {
							if(游戏数据[0].主角.事件[i].名称 == '黑木令'){
								剧情名称  = '剧情_黑木崖_东方不败';//持有黑木令可杀东方不败
							}
						}
					}
					if(黑木崖剧情线==2){
						剧情名称  = '剧情_黑木崖_引荐';
						if(游戏数据[0].主角.等级>=30){
							场景索引 = 2;
						}
					}
					if(黑木崖剧情线==3||黑木崖剧情线==4){
						剧情名称  = '剧情_黑木崖_观星台';
					}
					if(黑木崖剧情线==5){
						剧情名称  = '剧情_黑木崖_风雷堂';
					}
					if(黑木崖剧情线==6){
						剧情名称  = '剧情_黑木崖_废墟';
					}
				}
				if(剧情名称=='剧情_黑木崖任我行'&&场景索引==1){
					var rnd = game.rnd.between(1,9);
					//rnd = 2;   //debug
					if(rnd==2){
						场景索引 = 7;
					}
				}
				if(剧情名称=='剧情_明教总坛'){
					所处场景 = '剧情_明教';
					if(光明顶战役剧情线==0&&游戏数据[0].主角.等级>=30){
						剧情名称  = '剧情_明教_山道';
					}
					if(光明顶战役剧情线==1){
						剧情名称  = '剧情_明教_废墟';
						for (let i = 0; i < 游戏数据[0].主角.装备.length; i++) {
							if(游戏数据[0].主角.装备[i] == '倚天剑'){
								剧情名称  = '剧情_明教';
							}
						}
					}
				}
				if(剧情名称=='剧情_明教_光明顶'){
					if(场景索引==11&&游戏数据[0].主角.门派=='华山派'){
						剧情名称 = '剧情_明教_华山弃徒';
						场景索引 = 0;
					}
					if(场景索引==14&&游戏数据[0].主角.门派=='武当派'){
						剧情名称 = '剧情_明教_武当弃徒';
						场景索引 = 0;
					}
					if(场景索引==17&&游戏数据[0].主角.门派=='少林派'){
						剧情名称 = '剧情_明教_少林弃徒';
						场景索引 = 0;
					}
					if(场景索引==56){
						if(游戏数据[0].主角.门派 !== '武当派'){
							场景索引 = 58;
						}
					}
				}
				if(剧情名称=='剧情_华山派_导向'){//应该是导向到门派 具体看武当派剧情顺序
					if(华山派剧情线==0){
						剧情名称 = '剧情_华山派_拜师';
						if(游戏数据[0].主角.门派=='华山派'){
							剧情名称 = '剧情_华山派_日常';
						}
					}
				}
				if(剧情名称=='剧情_华山派'){
					if(游戏数据[0].主角.门派!=='华山派'){//场景索引==0

					}else{
						if(华山派剧情线==0){
							剧情名称 = '剧情_华山派_拜师';
							if(游戏数据[0].主角.门派=='华山派'){
								剧情名称 = '剧情_华山派_日常';
							}
						}
						if(华山派剧情线==1||华山思过崖剧情线==8){
							剧情名称 = '剧情_华山派_无人';
							if(游戏数据[0].主角.等级>=15){
								剧情名称 = '剧情_华山派_考验';
							}
						}
						if(华山派剧情线==2){
							剧情名称 = '剧情_华山派_考验_挑战';
						}
						if(华山派剧情线==3){
							剧情名称 = '剧情_华山派_终';
						}
					}
					if(场景索引==0&&左冷禅任务剧情线==5){//存在五岳令牌
						场景索引 = 8;
					}
					if(场景索引==2){
						if(游戏数据[0].主角.门派!=='无门派'){
							场景索引 = 4;
						}
					}
				}
				if(剧情名称=='剧情_华山派_拜师'&&场景索引==1){
					if(游戏数据[0].主角.侠义<50){
						场景索引 = 3;
					}
				}
				if(剧情名称=='剧情_华山派_日常令狐冲'&&场景索引==11){
					if(游戏数据[0].主角.悟性>=60&&游戏数据[0].主角.御剑>=28){

					}else{
						场景索引 = 13;
					}
				}
				if(剧情名称=='剧情_华山派_日常岳不群'){
					if(游戏数据[0].主角.等级>=10&&item['o_item'][49].修炼层数==5){
						剧情名称  = '剧情_华山派_思过崖_序';
					}
				}
				if(剧情名称=='剧情_休息_无提示'){
					if(所处场景=='剧情_华山派_思过崖'){
						华山思过崖剧情线++;
					}
				}
				if(剧情名称=='剧情_华山派_思过崖'){
					if(华山思过崖剧情线==3){
						剧情名称  = '剧情_华山派_思过崖_悟道';
						华山思过崖剧情线 = 4;
					}
					if(华山思过崖剧情线==5&&田伯光剧情线==5){
						剧情名称  = '剧情_华山派_思过崖_田伯光';
					}
					if(华山思过崖剧情线==6){
						剧情名称  = '剧情_华山派_思过崖_陆大有';
					}
					if(华山思过崖剧情线==7){
						if(游戏数据[0].主角.向岳不群请教武功>10){
							剧情名称  = '剧情_华山派_思过崖_岳不群';
						}else{
							剧情名称  = '剧情_华山派_思过崖_失约';
							if(游戏数据[0].主角.败给岳灵珊>10){
								剧情名称  = '剧情_华山派_思过崖_岳灵珊';
							}
						}
					}
				}
				if(剧情名称=='剧情_华山派_思过崖_悟道'&&场景索引==1){
					if(游戏数据[0].主角.悟性<=70){
						场景索引 = 3;
					}
				}
				if(剧情名称=='剧情_华山派_思过崖_田伯光'&&场景索引==14){
					if(游戏数据[0].主角.悟性>=90&&游戏数据[0].主角.福缘>=80&&!playerData.可用武学.剑[4].可用){
						场景索引 = 19;
					}
				}
				if(剧情名称=='剧情_华山派_终岳不群'){
					if(五岳掌门剧情线==0){
						场景索引 = 2;
					}
				}
				if(剧情名称=='剧情_襄阳妓院玉机子'&&场景索引==6){
					if(游戏数据[0].主角.银两>=1000){
						主角数据.银两-=1000;
						场景索引 = 7;
					}
				}
				if(剧情名称=='剧情_武当派_导向'){
					if(游戏数据[0].主角.门派=='武当派'){
						剧情名称 = '剧情_武当派';
					}
					if(场景索引==2&&游戏数据[0].主角.门派!=='无门派'){
						场景索引 = 4;
					}
				}
				if(剧情名称=='剧情_武当派'){
					if(武当派剧情线==0){
						剧情名称 = '剧情_武当派_拜师';
					}
					if(武当派剧情线==1){
						if(游戏数据[0].主角.等级>=30&&光明顶战役剧情线==0){
							剧情名称  = '剧情_武当派_远征';
							武当派剧情线 = 2;
						}else{
							剧情名称  = '剧情_武当派_日常';
						}
					}
					if(武当派剧情线==2||武当派剧情线==3){
						剧情名称  = '剧情_武当派_远征';
					}
					if(武当派剧情线==4){
						剧情名称  = '剧情_武当派_救难';
					}
					if(武当派剧情线==5){
						剧情名称  = '剧情_武当派_掌门';
					}
				}
				if(剧情名称=='剧情_武当派_拜师张三丰'&&场景索引==2){
					if(游戏数据[0].主角.侠义>=50&&游戏数据[0].主角.悟性>=60){
						场景索引 = 4;
					}
				}
				if(剧情名称=='剧情_少林寺_导向'){
					剧情名称 = '剧情_少林寺';
					if(游戏数据[0].主角.称号=='少林弃徒'){
						剧情名称 = '剧情_少林弃徒';
					}
					if(游戏数据[0].主角.门派=='少林派'){
						if(游戏数据[0].主角.杀孽>=20){
							剧情名称 = '剧情_少林寺_思过';
						}else{
							剧情名称  = '剧情_少林寺_日常';
						}
					}
				}
				if(剧情名称=='剧情_潜入少林寺'){
					if(场景索引==1){
						if(game.rnd.between(1,50)>game.rnd.between(1,游戏数据[0].主角.身法)){

						}else{
							场景索引 = 4;
						}
					}
					if(场景索引==6){
						if(game.rnd.between(1,80)>game.rnd.between(1,游戏数据[0].主角.身法)){

						}else{
							场景索引 = 9;
						}
					}
				}
				if(剧情名称=='剧情_少林寺_思过_伙房'){
					if(游戏数据[0].主角.少林思过>=5){
						剧情名称 = '剧情_少林寺_思过';
						场景索引 = 9;
					}
				}
				if(剧情名称=='剧情_开始菜单'){
					// 游戏初始化
					story_['剧情_战斗_教学'] = [];
					对手功力 = 1;
					强度 = 1;
					强度2 = 1;
					强度3 = 1;
					主角数据;
					游戏数据;
					剧情名称 = '剧情_序'; //游戏开局 剧情_序 
					场景索引 = 0;  //游戏开局0 调试bug32
					//var 剧情名称 = '剧情_序';
					//var 场景索引 = 32;
					对话框存在选项 = false;
					对话框跳转 = [];
					胜利时跳转 = {};
					失败时跳转 = {};
					audio;
					audios = [];
					a_i = 0;
					所处场景  = '';//主角所在场景
					//debug
					//story_['剧情_序'][33].跳转战斗名称 = '战斗_少林_僧人2';
					金盆洗手事件 = false;
					襄阳蒙冤事件 = false;
					襄阳衙门事件 = false;
					剑冢救雕事件 = false;
					英雄大会剧情线 = 0;//聚贤庄乔峰事件
					辟邪剑谱剧情线 = 0;//福威镖局、破庙、青城派杀余沧海
					无量山洞剧情线 = 0;//无量山洞、莽牯朱蛤
					长白山两女互斗剧情线 = 0;//等级35
					万劫谷剧情线 = 0;
					破庙剧情线 = 0;//辟邪剑谱线、弹指神通线 还会影响到南海鳄神线
					破庙练毒剧情线 = 0;//破庙阿紫
					昆仑派剧情线 = 0;//治病 九阳 需要医疗 80 福缘 80
					天龙寺剧情线 = 0;//一阳指 六脉剑谱
					侠客岛剧情线 = 0;//腊八粥 太玄经神功
					黑木崖剧情线 = 0;//加入日月神教
					光明顶战役剧情线 = 0;//散人 少林 武当 都会触发剧情 等级大于等于30
					武当派剧情线 = 0;
					华山派剧情线 = 0;
					少林寺剧情线 = 0;
					华山思过崖剧情线 = 0;
					田伯光剧情线 = 0;//衡阳遇田伯光 华山思过崖
					华山令狐冲剧情线 = 0;//可得独孤九剑或者无招胜有招
					左冷禅任务剧情线 = 0;
					金盆洗手剧情线 = 0;
					五岳掌门剧情线 = 0;//五岳并派
					武当派剧情线 = 0;
					声望150剧情线 = 0;
					声望500剧情线 = 0;
					声望600剧情线 = 0;
					声望900剧情线 = 0;
					游戏数据 = base['o_base'];
					playerData.可用武学['拳'].forEach(function(武学){
						武学.可用 = false;
					});
					playerData.可用武学['掌'].forEach(function(武学){
						武学.可用 = false;
					});
					playerData.可用武学['指'].forEach(function(武学){
						武学.可用 = false;
					});
					playerData.可用武学['剑'].forEach(function(武学){
						武学.可用 = false;
					});
					playerData.可用武学['内'].forEach(function(武学){
						武学.可用 = false;
					});
					for(var k in playerData){
						游戏数据[0].主角[k] = playerData[k];
					}
					for(var k in 主角数据){
						游戏数据[0].主角[k] = 主角数据[k];
					}
					game.state.start('menu');
				}
				if(剧情名称=='剧情_主地图'){//主地图事件
					场景索引 = 0;
					if(游戏数据[0].主角.拜神仙==20){//拜神仙20次事件
						剧情名称 = '剧情_拜神仙20次';
					}
					if(游戏数据[0].主角.声望 >= 900&&声望900剧情线==0){//华山论剑贴
						剧情名称 = '剧情_主地图_声望900';
						声望900剧情线 = 1;
						场景切换();
						return false;//这样才能共存 不然声望如果过高而剧情没有发展开会被覆盖掉
					}
					if(游戏数据[0].主角.声望 >= 600&&声望600剧情线==0){//赏善罚恶令//侠客岛剧情线==0
						剧情名称 = '剧情_主地图_声望600';
						声望600剧情线 = 1;
						场景切换();
						return false;
					}
					if(游戏数据[0].主角.声望 >= 500&&声望500剧情线==0){//聚贤庄请帖
						if(英雄大会剧情线==0){
							剧情名称 = '剧情_主地图_声望500';
							声望500剧情线 = 1;
							场景切换();
							return false;
						}
					}
					if(游戏数据[0].主角.声望 >= 150&&声望150剧情线==0){//金盆洗手贴
						剧情名称 = '剧情_主地图_声望150';
						声望150剧情线 = 1;
						场景切换();
						return false;
					}
					if(无量山洞剧情线==1){
						剧情名称 = '剧情_莽牯朱蛤';
					}
				}
				if(场景索引==-1){//需要选择场景的则索引开-1开始 根据条件跳转对话索引
					if(剧情名称=='剧情_侠客岛_参悟神功'){
						场景索引 = 0;
						if(游戏数据[0].主角.悟性 < 50){
							场景索引 = 4;
						}
						if(游戏数据[0].主角.悟性>=90){
							if(游戏数据[0].主角.学点>=5){
								游戏数据[0].主角.学点 -= 5;
								场景索引 = 4;
							}
						}
						if(游戏数据[0].主角.悟性<90&&游戏数据[0].主角.悟性>50){
							if(游戏数据[0].主角.学点>=3){
								游戏数据[0].主角.学点 -= 3;
								场景索引 = 4;
							}else{
								场景索引 = 2;
							}
						}
					}
					if(剧情名称=='剧情_襄阳衙门'){
						场景索引 = 0;
						for (let i = 0; i < 游戏数据[0].主角.事件.length; i++) {
							if(游戏数据[0].主角.事件[i].名称 == '笑傲江湖谱'&&!襄阳蒙冤事件){
								剧情名称 = '剧情_襄阳蒙冤';
								场景索引 = -1;
							}
						}
						if(襄阳蒙冤事件){
							场景索引 = 3;
						}
						if(襄阳衙门事件){
							场景索引 = 13;
						}
						场景切换();
					}
					if(剧情名称=='剧情_襄阳蒙冤'){
						襄阳蒙冤事件 = true;
						场景索引 = 0;
						场景切换();
					}
					if(剧情名称=='剧情_衡阳刘府'){
						场景索引 = 0;
						for (let i = 0; i < 游戏数据[0].主角.事件.length; i++) {
							if(游戏数据[0].主角.事件[i].名称 == '金盆洗手贴'){
								场景索引 = 4;
							}
							if(游戏数据[0].主角.事件[i].名称 == '五岳令牌'){
								场景索引 = 6;
							}
							
						}
						if(金盆洗手事件){
							场景索引 = 2;
						}
						场景切换();
					}
					if(剧情名称=='剧情_金盆洗手'){
						金盆洗手事件 = true;
						游戏数据[0].主角.事件.forEach(事件道具 => {
							switch (事件道具.名称) {
								case '五岳令牌':
									场景索引 = 0;
									break;
								default:
									场景索引 = 17;
									break;
							}
						});
						场景切换();
					}
					if(剧情名称=='剧情_衡阳武馆馆主'){
						if(游戏数据[0].主角.可用武学.拳[0].可用){
							场景索引 = 1;
						}else{
							场景索引 = 0;
						}
						场景切换();
					}
					if(剧情名称=='剧情_衡阳客栈店小二'){
						场景索引 = 0;
						for(let i=0;i<游戏数据[0].主角.事件.length;i++){
							if(!金盆洗手事件){
								场景索引 = 0;
								break;
							}
						}
						if(游戏数据[0].主角.声望 >= 800){
							场景索引 = 2;
						}
						if(金盆洗手事件&&游戏数据[0].主角.声望<800){
							场景索引 = 4;
						}
						场景切换();
						return false;
					}
					if(剧情名称=='剧情_衡阳客栈酒客'){
						var rnd = game.rnd.between(0,7);
						场景索引 = rnd * 2;
						场景切换();
						return false;
					}
					if(剧情名称=='剧情_襄阳妓院小宝货郎'){
						var rnd = game.rnd.between(0,4);
						场景索引 = rnd * 2;
						场景切换();
						return false;
					}
					if(剧情名称=='剧情_渡口张三'){
						场景索引 = 0;
						游戏数据[0].主角.事件.forEach(事件道具 => {
							/* switch (事件道具.名称) {
								case '赏善罚恶令':
									场景索引 = 2;
									break;
								default:
									break;
							} */
							if(侠客岛剧情线==1){
								场景索引 = 2;
							}
							if(侠客岛剧情线==3){//领悟出太玄神功则不再进入侠客岛
								场景索引 = 4;
							}
						});
						场景切换();
						return false;
					}
					if(剧情名称=='剧情_渡口杨过'){
						var rnd = game.rnd.between(0,3);
						场景索引 = rnd * 2;
						if(游戏数据[0].主角.等级>=20&&!playerData.可用武学.掌[3].可用){//未习得黯然销魂掌
							场景索引 = 8;
						}
						场景切换();
						return false;
					}
					if(剧情名称=='剧情_百花谷战斗失败'){
						if(playerData.可用武学.拳[2].可用 || 是否存在天赋('左右互搏之术')){
							场景索引 = 0;
						}else if(游戏数据[0].主角.悟性 <= 50){
							场景索引 = 2;
						}else{
							场景索引 = 5;
						}
						场景切换();
						return false;
					}
					if(剧情名称=='剧情_百花谷战斗胜利'){
						for(let i=0;i<游戏数据[0].主角.秘籍.length;i++){
							场景索引 = 2;
							if(游戏数据[0].主角.秘籍[i].名称=='九阴真经'){
								场景索引 = 0;
							}
						}
						场景切换();
						return false;
					}
					if(剧情名称=='剧情_主角母亲'){//主角家 母亲的言语与主角的侠义挂钩
						场景索引 = 0; //侠义为50					//我现在才知道原来善恶是以50分界…
						if(游戏数据[0].主角.侠义 >=0&& 游戏数据[0].主角.侠义 <= 34){
							场景索引 = 2;
						}
						if(游戏数据[0].主角.侠义 >=35&& 游戏数据[0].主角.侠义 <= 49){
							场景索引 = 4;
						}
						if(游戏数据[0].主角.侠义 >=51&& 游戏数据[0].主角.侠义 <= 69){
							场景索引 = 6;
						}
						if(游戏数据[0].主角.侠义 >=70&& 游戏数据[0].主角.侠义 <= 100){
							场景索引 = 6;
							if(游戏数据[0].主角.声望 >= 600){
								场景索引 = 8;
							}
						}
						场景切换();
						return false;
					}
					if(剧情名称=='剧情_剑冢'){
						场景索引 = 0;
						if(剑冢救雕事件){
							剧情名称 = '剧情_剑冢2';
						}else{
							if(游戏数据[0].主角.等级 >= 20){
								剧情名称 = '剧情_剑冢_救雕';
							}
						}
						场景切换();
						return false;
					}
					if(剧情名称=='剧情_聚贤庄'){
						场景索引 = 0;
						for(let i=0;i<游戏数据[0].主角.事件.length;i++){
							if(游戏数据[0].主角.事件[i].名称=='聚贤庄请帖'){
								if(英雄大会剧情线==0){
									剧情名称 = '剧情_聚贤庄_乔峰';
								}
								if(英雄大会剧情线>0){
									场景索引 = 3;
								}
							}
						}
						场景切换();
						return false;
					}
					if(剧情名称=='剧情_福威镖局林平之'){
						场景索引 = 0;
						if(辟邪剑谱剧情线==1){
							场景索引 = 3;
						}
						if(辟邪剑谱剧情线==2){
							场景索引 = 6;
						}
						if(辟邪剑谱剧情线==3){
							场景索引 = 9;
						}
						if(辟邪剑谱剧情线==4){
							场景索引 = 11;
						}
						if(辟邪剑谱剧情线==5){
							场景索引 = 15;
						}
					}
					if(剧情名称=='剧情_无量山洞'){
						if(无量山洞剧情线==0){
							场景索引 = 0;
						}else{
							场景索引 = 220;
						}
					}
					if(剧情名称=='剧情_万劫谷'){
						场景索引 = 0;
						if(万劫谷剧情线==0&&游戏数据[0].主角.等级>=20){
							场景索引 = 2;
						}
					}
					if(剧情名称=='剧情_破庙'){
						场景索引 = 0;
						if(辟邪剑谱剧情线==1){//需要到林平之接了任务
							场景索引 = 2;
						}
						if(破庙剧情线==1){//先过辟邪剑谱剧情线再进入弹指神通剧情线
							场景索引 = 32;
						}
						if(破庙练毒剧情线==0&&游戏数据[0].主角.侠义<50){
							剧情名称 = '剧情_路遇阿紫';
						}
					}
					if(剧情名称=='剧情_长白山'){
						场景索引 = 0;
						if(英雄大会剧情线==1){//需要聚贤庄帮主乔峰
							场景索引 = 2;
						}
						if(长白山两女互斗剧情线==0&&游戏数据[0].主角.等级>=35){//李秋水童姥
							场景索引 = 10;
						}
					}
					if(剧情名称=='剧情_昆仑派'){
						场景索引 = 0;
						if(昆仑派剧情线==0&&游戏数据[0].主角.医疗>=80){//需要医疗80
							场景索引 = 2;
						}
					}
					if(剧情名称=='剧情_青城派'){
						场景索引 = 0;
						if(辟邪剑谱剧情线==3){
							场景索引 = 2;
						}
						if(辟邪剑谱剧情线>=4){
							场景索引 = 32;
						}
					}
					if(剧情名称=='剧情_天龙寺'){
						场景索引 = 0;
						if(天龙寺剧情线==0&&游戏数据[0].主角.等级>=26){//需要等级26
							场景索引 = 2;
						}
					}
					if(剧情名称=='剧情_华山派_日常岳灵珊'){
						var rnd = game.rnd.between(0,4);
						场景索引 = rnd * 2;
					}
					if(剧情名称=='剧情_华山派_日常陆大有'){
						var rnd = game.rnd.between(0,6);
						场景索引 = rnd * 2;
					}
					if(剧情名称=='剧情_华山派_请教武功'){
						var rnd = game.rnd.between(0,6);
						场景索引 = rnd * 2;
						var rnd_ = game.rnd.between(1,7);
						if(rnd_<=3){
							主角数据.向岳不群请教武功++;
						}
					}
					if(剧情名称=='剧情_华山派_江湖掌故'){
						var rnd = game.rnd.between(0,6);
						场景索引 = rnd * 2;
					}
					if(剧情名称=='剧情_华山派_日常令狐冲'){
						if(华山令狐冲剧情线==0){
							场景索引 = 0;
						}
						if(华山令狐冲剧情线==6){
							场景索引 = 15;
						}
						if(华山令狐冲剧情线==1){
							场景索引 = 2;
						}
						if(华山令狐冲剧情线==2){
							for (let i = 0; i < 游戏数据[0].主角.事件.length; i++) {
								if(游戏数据[0].主角.事件[i].名称 == '关外白酒'){
									场景索引 = 4;
									break;
								}else{
									场景索引 = 15;
								}
							}
						}
						if(华山令狐冲剧情线==3){
							for (let i = 0; i < 游戏数据[0].主角.事件.length; i++) {
								if(游戏数据[0].主角.事件[i].名称 == '犀角杯'){
									场景索引 = 6;
									break;
								}else{
									场景索引 = 15;
								}
							}
						}
						if(华山令狐冲剧情线==4){
							for (let i = 0; i < 游戏数据[0].主角.事件.length; i++) {
								if(游戏数据[0].主角.事件[i].名称 == '葡萄酒'){
									场景索引 = 8;
									break;
								}else{
									场景索引 = 15;
								}
							}
						}
						if(华山令狐冲剧情线==5){
							for (let i = 0; i < 游戏数据[0].主角.事件.length; i++) {
								if(游戏数据[0].主角.事件[i].名称 == '夜光杯'){
									场景索引 = 10;
									break;
								}else{
									场景索引 = 15;
								}
							}
						}
					}
					if(剧情名称=='剧情_襄阳妓院玉机子'){
						场景索引 = 0;
						if(左冷禅任务剧情线==8){
							场景索引 = 2;
						}
					}
					if(剧情名称=='剧情_铸剑谷'){
						场景索引 = 0;
						if(左冷禅任务剧情线==11){
							场景索引 = 2;
						}
						if(左冷禅任务剧情线==12){
							场景索引 = 8;
						}
					}
					if(剧情名称=='剧情_嵩山派_导向'){
						if(左冷禅任务剧情线==0){
							场景索引 = 4;
						}
						if(左冷禅任务剧情线>0){
							场景索引 = 5;
						}
						if(游戏数据[0].主角.门派=='华山派'){
							场景索引 = 2;
						}
						if(五岳掌门剧情线==1){
							场景索引 = 0;
						}
					}
					if(剧情名称=='剧情_嵩山派左冷禅'){
						if(左冷禅任务剧情线==0){
							场景索引 = 0;
						}
						if(左冷禅任务剧情线==1){
							if(金盆洗手剧情线==0){
								场景索引 = 1;
							}else{
								场景索引 = 4;
							}
						}
						if(左冷禅任务剧情线==3){
							场景索引 = 6;
						}
						if(左冷禅任务剧情线==4){
							场景索引 = 9;
						}
						if(左冷禅任务剧情线==6){
							场景索引 = 11;
						}
						if(左冷禅任务剧情线==7){
							场景索引 = 14;
						}
						if(左冷禅任务剧情线==9){
							场景索引 = 16;
						}
						if(左冷禅任务剧情线==10){
							场景索引 = 19;
						}
						if(左冷禅任务剧情线==13){
							场景索引 = 24;
						}
						if(左冷禅任务剧情线==2||左冷禅任务剧情线==5||左冷禅任务剧情线==8||左冷禅任务剧情线==11){
							场景索引 = 26;
						}
						if(左冷禅任务剧情线==12||左冷禅任务剧情线==14){
							场景索引 = 28;
						}
					}
					if(剧情名称=='剧情_武当派_日常张三丰'||剧情名称=='剧情_武当派_日常宋远桥'){
						var rnd = game.rnd.between(0,3);
						场景索引 = rnd * 2;
					}
					if(剧情名称=='剧情_武当派_日常张翠山'){
						var rnd = game.rnd.between(0,4);
						场景索引 = rnd * 2;
					}
					if(剧情名称=='剧情_武当派_日常俞岱岩'){
						场景索引 = 0;
						if(!是否存在秘籍('武当心法')){
							场景索引 = 2;
						}
						if(item['o_item'][51].修炼层数==5){
							if(!是否存在秘籍('梯云纵')){
								场景索引 = 4;
							}
						}
						if(游戏数据[0].主角.等级>=10){
							if(!playerData.可用武学.掌[1].可用){
								场景索引 = 6;
							}
						}
					}
					if(剧情名称=='剧情_武当派_远征张三丰'){
						场景索引 = 0;
						if(武当派剧情线==3){
							场景索引 = 2;
						}
					}
					if(剧情名称=='剧情_少林寺_日常玄慈'){
						场景索引 = 0;
						if(游戏数据[0].主角.等级>=30&&光明顶战役剧情线==0){
							场景索引 = 2;
						}
					}
					if(剧情名称=='剧情_少林寺_日常玄苦'){
						场景索引 = 8;
						if(!playerData.可用武学.拳[1].可用){
							场景索引 = 0;
						}
						if(kungfu['o_kungfu'][3].等级>=6){
							if(!playerData.可用武学.掌[2].可用){
								场景索引 = 2;
							}
						}
						if(kungfu['o_kungfu'][10].等级>=6){
							if(!playerData.可用武学.指[3].可用){
								场景索引 = 4;
							}
						}
						if(kungfu['o_kungfu'][16].等级>=6){
							if(!playerData.可用武学.指[2].可用){
								场景索引 = 6;
							}
						}
					}
					if(剧情名称=='剧情_潜入藏经阁'){
						var rnd = game.rnd.between(0,7);
						if(rnd<5){
							场景索引 = rnd * 2;
						}
						if(rnd==5){
							场景索引 = 0;
							if(!playerData.可用武学.指[2].可用){
								场景索引 = 10;
							}
						}
						if(rnd==6){
							场景索引 = 2;
							if(!是否存在秘籍('易筋经')){
								场景索引 = 12;
							}
						}
						if(rnd==7){
							场景索引 = 4;
							if(是否存在秘籍('易筋经')&&playerData.可用武学.指[2].可用){
								场景索引 = 14;
							}
						}
					}
					if(剧情名称=='剧情_少林寺_思过_伙房缘根'){
						var rnd = game.rnd.between(0,4);
						场景索引 = rnd * 3;
					}
				}
				/* if(剧情名称=='剧情_衡阳医馆大夫'&&场景索引==0){//需要跟金盆洗手事件一样再增加一个剧情错开有钱跟没钱……
					if(游戏数据[0].主角.银两<100&&场景索引==1||游戏数据[0].主角.银两<5&&场景索引==2||游戏数据[0].主角.银两<15&&场景索引==3){
						场景索引 = 4;
					}
					场景切换();
				} */
				if (story_[剧情名称][场景索引].剧情类型!=='undefined'&&story_[剧情名称][场景索引].剧情类型=='场景') {
					game.state.start('scene');
					return false;
				}
				if (story_[剧情名称][场景索引].剧情类型!=='undefined'&&story_[剧情名称][场景索引].剧情类型=='城市') {
					城市事件(game);
					return false;
				}
				if(story_[剧情名称][场景索引].剧情类型!=='undefined'&&story_[剧情名称][场景索引].剧情类型=='主地图'){
					game.state.start('bigMap');
					return false;
				}
				dialog_UI.alpha = 1;
				剧情 = 剧情名称;
				var 背景图像 = story_[剧情][场景索引].背景图片.toString(16).substring(4);
				if (背景图像=='') {
					bg.alpha = 0;
				}else{
					bg.alpha = 1;
					bg.loadTexture(`map${背景图像}`);
					bg.width = game.width;
					bg.height = game.height;
				}
				var 立绘图片 = [];
				var 立绘名称 = [];
				for (let i = 0; i < heads.length; i++) {
					立绘图片[i] = story_[剧情][场景索引].立绘图片[i];
					立绘名称[i] = story_[剧情][场景索引].立绘名称[i];
					if (typeof(立绘图片[i])=='undefined') {
						continue;
					}
					if (立绘图片[i]=='') {
						heads.children[i].alpha = 0;
						continue;
					}else{
						heads.children[i].alpha = 1;
					}
					立绘图片[i] = 立绘图片[i].toString(16).substring(4);
					heads.children[i].loadTexture(`head${立绘图片[i]}`);
					heads.children[i].name = 立绘名称[i];
				}
				var 对话框头像 = story_[剧情][场景索引].对话框头像.toString(16).substring(4);
				if (对话框头像=='') {
					dialog_UI.alpha = 0;
				}else{
					dialog_box_head.loadTexture(`head${对话框头像}`);
					var 对话框姓名 = story_[剧情][场景索引].对话框姓名;
					dialog_box_name.text = 对话框姓名;
					var 对话框对白 = story_[剧情][场景索引].对话框对白;
					var 对话框选项 = story_[剧情][场景索引].对话框选项;
					对话框跳转 = story_[剧情][场景索引].对话框跳转;
					if (typeof(对话框选项)=='undefined') {
						对话框存在选项 = false;
						for(let i=0;i<5;i++){
							dialog_box_select[i].text = '';
						}
						//dialog_box_option_1.text = '';
						//dialog_box_option_2.text = '';
						
						dialog_box_text.text = 对话框对白.slice(0,28)+'\n'+对话框对白.slice(28);
					}else{
						对话框存在选项 = true;
						dialog_box_text.text = '';
						//dialog_box_option_1.text = 对话框选项[0];
						//dialog_box_option_2.text = 对话框选项[1];
						// dialog_box_option_1.events.onInputDown.add(function(){
						// 	var 跳转 = 对话框跳转[0];
						// 	//console.log(跳转);
						// 	剧情名称 = 跳转.剧情名称;
						// 	场景索引 = 跳转.场景索引;
						// 	场景切换();
						// 	对话框存在选项 = false;
						// },this);
						// dialog_box_option_2.events.onInputDown.add(function(){
						// 	var 跳转 = 对话框跳转[1];
						// 	//console.log(跳转);
						// 	剧情名称 = 跳转.剧情名称;
						// 	场景索引 = 跳转.场景索引;
						// 	场景切换();
						// 	对话框存在选项 = false;
						// },this);
						for(let i=0;i<5;i++){
							dialog_box_select[i].text = '';
						}
						for(let i=0;i<对话框选项.length;i++){
							dialog_box_select[i].text = 对话框选项[i];
						}
					}
				}

				var 序列帧动画 = story_[剧情][场景索引].序列帧动画;
				//console.log(序列帧动画);
				if (序列帧动画.是否播放) {//应该像音频播放一样定义全局变量 然后再进行动画移除操作 懒得写了……
					var anim = game.add.group();
					var anims = [];
					for (let i = 0; i < 序列帧动画.动画.length; i++) {
						anim.create(0,0,序列帧动画.动画[i].精灵图);
						anim.children[i].anchor.setTo(0.5,0.6);
						anim.children[i].x = heads.children[序列帧动画.动画[i].位置].x;
						anim.children[i].y = heads.children[序列帧动画.动画[i].位置].y;
						anims[i] = anim.children[i].animations.add('eft');
						anims[i].play(序列帧动画.动画[i].帧率,false);
						anims[i].onComplete.add(function(){
							console.log('动画播放完毕');
							if(序列帧动画.自动转场){
								场景索引++;
								场景切换();
							}
							anim.destroy();
							/* var 跳转 = 序列帧动画.跳转;//这样比较繁琐 直接用自动转场替换
							if (typeof(跳转)!=='undefined') {
								剧情名称 = 跳转.剧情名称;
								场景索引 = 跳转.场景索引;
							}
							anim.destroy();
							场景切换(); */
						},this);
					}
				}
				var 跳转战斗教学 = story_[剧情][场景索引].跳转战斗教学;
				if (跳转战斗教学) {
					//console.log('需要写一个战斗模块【教学关卡】');
				}
				//console.log(story_[剧情][场景索引].编号);
				var 增值量 = {
					'声望':0,
					'银两':0,
					'经验':0,
					'学点':0,
					'侠义':0,
					'杀孽':0,
				};
				var 获得物品 = story_[剧情][场景索引].获得物品;
				if (typeof(获得物品)!=='undefined') {
					for (let i = 0; i < 获得物品.length; i++) {
						if (获得物品[i].类型=='秘籍') {
							主角数据['秘籍'].push({
								'名称':获得物品[i].名称,
								'数量':获得物品[i].数量
							});
						}
						if (获得物品[i].类型=='事件') {
							主角数据['事件'].push({
								'名称':获得物品[i].名称,
								'数量':获得物品[i].数量
							});
						}
						if (获得物品[i].类型=='丹药') {//叠加计算
							主角数据['丹药'].forEach(function(丹药){
								if(丹药.名称==获得物品[i].名称){
									主角数据['丹药'].push({
										'名称':获得物品[i].名称,
										'数量':获得物品[i].数量 + 丹药.数量
									});
								}
							});
						}
						if (获得物品[i].类型=='装备') {
							主角数据['装备'].push(获得物品[i].名称);
						}
						if (获得物品[i].类型=='称号') {
							主角数据['称号'] = 获得物品[i].名称;
						}
						if (获得物品[i].类型=='门派') {
							主角数据['门派'] = 获得物品[i].名称;
						}
						if (获得物品[i].类型 == '属性') {
							//console.log(获得物品[i].名称);
							增值量[获得物品[i].名称] = 获得物品[i].数量;
							主角数据[获得物品[i].名称] += 增值量[获得物品[i].名称];
							//console.log(主角数据[获得物品[i].名称]);
						}
						if(获得物品[i].类型=='武学'){
							playerData.可用武学[获得物品[i].武学类型].forEach(function(武学){
								if(武学.名称==获得物品[i].名称){
									武学.可用 = true;
								}
							});
						}
						if(获得物品[i].类型=='天赋'){//天赋 左右互搏之术 攻击两次
							主角数据['天赋'].push(获得物品[i].名称);
						}
					}
					if(主角数据.败给岳灵珊 < 0){
						主角数据.败给岳灵珊 = 0;
					}
					for(var k in 主角数据){
						游戏数据[0].主角[k] = 主角数据[k];
					}
					console.log(游戏数据[0].主角);
				}
				if(typeof(story_[剧情][场景索引].属性设置)!=='undefined'){//固定值
					for (let i = 0; i < story_[剧情][场景索引].属性设置.length; i++) {
						主角数据[story_[剧情][场景索引].属性设置[i].名称] = story_[剧情][场景索引].属性设置[i].数值;
					}
					for(var k in 主角数据){
						游戏数据[0].主角[k] = 主角数据[k];
					}
				}
				if(typeof(story_[剧情][场景索引].变更属性)!=='undefined'){//非固定值
					for (let i = 0; i < story_[剧情][场景索引].变更属性.length; i++) {
						if(typeof(story_[剧情][场景索引].变更属性[i].百分比)!=='undefined'){
							主角数据[story_[剧情][场景索引].变更属性[i].名称] *= story_[剧情][场景索引].变更属性[i].百分比;
						}
					}
					for(var k in 主角数据){
						游戏数据[0].主角[k] = 主角数据[k];
					}
				}
				var 播放音效 = story_[剧情][场景索引].播放音效;
				if (typeof(播放音效)!=='undefined') {
					var 移除声音 = story_[剧情][场景索引].移除声音;
					/* if(typeof(移除声音)!=='undefined'){
						for (let i = 0; i < audios.length; i++) {
							audios[i].destroy();	
						}
					} */
					audio = game.add.audio(`mp3${播放音效.toString(16).substring(4)}`);
					audios[a_i] = audio;
					a_i++;
					audio.play();
				}
				
				
				if(typeof(story_[剧情][场景索引].剧情线)!=='undefined'){
					window[story_[剧情][场景索引].剧情线.名称] = story_[剧情][场景索引].剧情线.标记;
					if(story_[剧情][场景索引].剧情线.length > 0){
						for (let i = 0; i < story_[剧情][场景索引].剧情线.length; i++) {
							window[story_[剧情][场景索引].剧情线[i].名称] = story_[剧情][场景索引].剧情线[i].标记;
						}
					}
				}
				if(typeof(story_[剧情][场景索引].对手功力)!=='undefined'){
					对手功力 = story_[剧情][场景索引].对手功力;
				}
				
				this.引导按钮组 = game.add.group();
				if(typeof(story_[剧情][场景索引].引导按钮)!=='undefined'){
					var 剧情_切换 = [];
					for (let i = 0; i < story_[剧情][场景索引].引导按钮.length; i++) {
						剧情_切换[i] = function(){
							剧情名称 = story_[剧情][场景索引].引导按钮[i].跳转剧情.剧情名称;
							场景索引 = story_[剧情][场景索引].引导按钮[i].跳转剧情.场景索引;
							场景切换();
						}
						var btn = game.add.button(0, 0, 'sys_btn', 剧情_切换[i], this, 1, 0, 2);
						btn.scale.setTo(1.3,1.2);
						btn.x =	game.width - btn.width;
						btn.y = game.height - dialog_box.height - btn.height;
						var text = game.add.text(btn.x+btn.width/3,btn.y + btn.height / 8,story_[剧情][场景索引].引导按钮[i].名称,{fill:'black',fontSize:16});
						引导按钮组.add(btn);
						引导按钮组.add(text);
					}
				}

				//所有判断都要在跳转之前进行

				if(typeof(story_[剧情][场景索引].休息)!=='undefined'){
					对话框存在选项 = true;
					var showBox = game.add.group();
					var box = game.add.image(game.world.centerX,game.world.centerY,'0037');
					box.anchor.setTo(0.5);
					var text1 = game.add.text(game.world.centerX,game.world.centerY,'您现在体力充沛',{fontSize:16});
					text1.anchor.setTo(0.5);
					var text2 = game.add.text(game.world.centerX,game.world.centerY,'生命补满',{fontSize:16});
					text2.anchor.setTo(0.5);
					var text3 = game.add.text(game.world.centerX,game.world.centerY,'内力补满',{fontSize:16});
					text3.anchor.setTo(0.5);
					text1.y -= text1.height;
					text3.y += text1.height;
					showBox.add(box);
					showBox.add(text1);
					showBox.add(text2);
					showBox.add(text3);
					box.inputEnabled = true;
					box.events.onInputDown.addOnce(function(){
						主角数据.生命 = 游戏数据[0].主角.生命上限;
						主角数据.内力 = 游戏数据[0].主角.内力上限;
						对话框存在选项 = false;
						showBox.destroy();
						剧情名称 = 所处场景;
						场景索引 = 0;
						场景切换();
					},this);
					if(!story_[剧情][场景索引].休息){
						showBox.destroy();
						var timerEvent = game.time.events.add(Phaser.Timer.SECOND * Math.floor(1500/1000), function(){//这里是定时器延时
							主角数据.生命 = 游戏数据[0].主角.生命上限;
							主角数据.内力 = 游戏数据[0].主角.内力上限;
							对话框存在选项 = false;
							剧情名称 = 所处场景;
							场景索引 = 0;
							场景切换();
							game.time.events.remove(timerEvent);
						}, this);
					}
				}

				var 跳转剧情 = story_[剧情][场景索引].跳转剧情;
				//console.log(跳转剧情[剧本]);
				if (typeof(跳转剧情)!=='undefined') {
					剧情名称 = 跳转剧情.剧情名称;
					场景索引 = 跳转剧情.场景索引;
					//console.log(`${剧情名称},${场景索引}`);
					场景切换();
				}
				
				this.不可跳转 = story_[剧情][场景索引].不可跳转;//this指向window
				
				this.延时跳转 = story_[剧情][场景索引].延时跳转;
				if(typeof(延时跳转)!=='undefined'){
					var timerEvent = game.time.events.add(Phaser.Timer.SECOND * Math.floor(延时跳转.延时时间/1000), function(){//这里是定时器延时
						if(typeof(延时跳转)=='undefined'){return false;}
						剧情名称 = 延时跳转.跳转剧情.剧情名称;
						场景索引 = 延时跳转.跳转剧情.场景索引;
						场景切换();
						game.time.events.remove(timerEvent);
					}, this);
				}

				var 跳转战斗 = story_[剧情][场景索引].跳转战斗;
				if (跳转战斗) {
					var 跳转战斗名称 = story_[剧情][场景索引].跳转战斗名称;
					胜利时跳转 = story_[剧情][场景索引].胜利时跳转;
					失败时跳转 = story_[剧情][场景索引].失败时跳转;
					剧情 = 跳转战斗名称;
					game.state.start('fight');
					return false;
				}

				

				
			}

 			场景切换();

			
		};
        
		this.update=function(){

		}
		
	}




	var game=new Phaser.Game(WIDTH,HEIGHT,Phaser.CANVAS,'container');														//创建游戏对象
	game.state.add('boot',bootState);																					//添加游戏场景
	game.state.add('loader',loaderState);
	game.state.add('menu',menuState);
	game.state.add('game',gameState);
	game.state.add('fight',fightState);
	game.state.add('bigMap',mapState);
	game.state.add('scene',sceneState);
	game.state.add('death',deathState);
	game.state.start('boot');																							//启动游戏场景

}


