/*
 * @Author: MngYou
 * @Date: 2022-01-17 19:15:08
 * @LastEditTime: 2022-02-05 16:53:25
 * @FilePath: \wx\script\story\addFightStory.js
 */
(function(){
    var 添加战斗剧情 = function(名称,对手){
        story_[名称] = {};
        story_[名称] .当前剧本 = 名称;
        story_[名称] .对手 = 对手;
        //story_[名称] .主角 = playerData;
    }
    添加战斗剧情('战斗_序_老虎',enemysData.序_老虎);
    添加战斗剧情('战斗_序_庸医',enemysData.序_庸医);
    添加战斗剧情('战斗_主地图_莽牯朱蛤',enemysData.主地图_莽牯朱蛤);
    添加战斗剧情('战斗_主地图_封不平',enemysData.主地图_封不平);
    添加战斗剧情('战斗_主地图_老虎',enemysData.主地图_老虎);
    添加战斗剧情('战斗_主地图_毛贼',enemysData.主地图_毛贼);
    添加战斗剧情('战斗_主地图_恶贼',enemysData.主地图_恶贼);
    添加战斗剧情('战斗_主地图_恶霸',enemysData.主地图_恶霸);
    添加战斗剧情('战斗_主地图_神仙',enemysData.主地图_神仙);
    添加战斗剧情('战斗_衡阳_武馆馆主',enemysData.馆主);
    添加战斗剧情('战斗_衡阳_费斌',enemysData.衡阳_费斌);
    添加战斗剧情('战斗_衡阳_打手',enemysData.打手);
    添加战斗剧情('战斗_襄阳_官兵',enemysData.襄阳_官兵);
    添加战斗剧情('战斗_襄阳_丁典',enemysData.襄阳_丁典);
    添加战斗剧情('战斗_少林_无名僧',enemysData.少林_无名僧);
    添加战斗剧情('战斗_少林_僧人',enemysData.少林_僧人);
    添加战斗剧情('战斗_少林_僧人2',enemysData.少林_僧人2);
    添加战斗剧情('战斗_武当_宋青书',enemysData.武当_宋青书);
    添加战斗剧情('战斗_武当_阿三',enemysData.武当_阿三);
    添加战斗剧情('战斗_武当_阿大',enemysData.武当_阿大);
    添加战斗剧情('战斗_华山_梁发',enemysData.华山_梁发);
    添加战斗剧情('战斗_华山_岳灵珊',enemysData.华山_岳灵珊);
    添加战斗剧情('战斗_华山_田伯光',enemysData.华山_田伯光);
    添加战斗剧情('战斗_华山_岳不群',enemysData.华山_岳不群);
    添加战斗剧情('战斗_嵩山_弟子',enemysData.嵩山_弟子);
    添加战斗剧情('战斗_嵩山_岳灵珊',enemysData.嵩山_岳灵珊);
    添加战斗剧情('战斗_嵩山_玉机子',enemysData.嵩山_玉机子);
    添加战斗剧情('战斗_嵩山_左冷禅',enemysData.嵩山_左冷禅);
    添加战斗剧情('战斗_黑木崖_杨莲亭',enemysData.黑木崖_杨莲亭);
    添加战斗剧情('战斗_黑木崖_东方不败',enemysData.黑木崖_东方不败);
    添加战斗剧情('战斗_黑木崖_向问天',enemysData.黑木崖_向问天);
    添加战斗剧情('战斗_黑木崖_任我行1',enemysData.黑木崖_任我行1);
    添加战斗剧情('战斗_黑木崖_任我行2',enemysData.黑木崖_任我行2);
    添加战斗剧情('战斗_黑木崖_任我行3',enemysData.黑木崖_任我行3);
    添加战斗剧情('战斗_明教_教众',enemysData.明教_教众);
    添加战斗剧情('战斗_明教_成昆',enemysData.明教_成昆);
    添加战斗剧情('战斗_明教_唐文亮',enemysData.明教_唐文亮);
    添加战斗剧情('战斗_明教_岳不群',enemysData.明教_岳不群);
    添加战斗剧情('战斗_明教_宋远桥',enemysData.明教_宋远桥);
    添加战斗剧情('战斗_明教_玄慈',enemysData.明教_玄慈);
    添加战斗剧情('战斗_明教_灭绝1',enemysData.明教_灭绝1);
    添加战斗剧情('战斗_明教_灭绝2',enemysData.明教_灭绝2);
    添加战斗剧情('战斗_明教_张无忌',enemysData.明教_张无忌);
    添加战斗剧情('战斗_万劫谷_南海鳄神',enemysData.万劫谷_南海鳄神);
    添加战斗剧情('战斗_万劫谷_段延庆',enemysData.万劫谷_段延庆);
    添加战斗剧情('战斗_天龙寺_鸠摩智',enemysData.天龙寺_鸠摩智);
    添加战斗剧情('战斗_剑冢_怪蟒',enemysData.剑冢_怪蟒);
    添加战斗剧情('战斗_剑冢_巨雕1',enemysData.剑冢_巨雕1);
    添加战斗剧情('战斗_剑冢_巨雕2',enemysData.剑冢_巨雕2);
    添加战斗剧情('战斗_百花谷_周伯通',enemysData.百花谷_周伯通);
    添加战斗剧情('战斗_渡口_杨过',enemysData.渡口_杨过);
    添加战斗剧情('战斗_侠客岛_岛主1',enemysData.侠客岛_岛主1);
    添加战斗剧情('战斗_侠客岛_岛主2',enemysData.侠客岛_岛主2);
    添加战斗剧情('战斗_铸剑谷_定逸',enemysData.铸剑谷_定逸);
    添加战斗剧情('战斗_铸剑谷_杀手',enemysData.铸剑谷_杀手);
    添加战斗剧情('战斗_破庙_木高峰',enemysData.破庙_木高峰);
    添加战斗剧情('战斗_破庙_李莫愁1',enemysData.破庙_李莫愁1);
    添加战斗剧情('战斗_破庙_李莫愁2',enemysData.破庙_李莫愁2);
    添加战斗剧情('战斗_破庙_毒蛇',enemysData.破庙_毒蛇);
    添加战斗剧情('战斗_破庙_阿紫',enemysData.破庙_阿紫);
    添加战斗剧情('战斗_聚贤庄_乔峰',enemysData.聚贤庄_乔峰);
    添加战斗剧情('战斗_聚贤庄_杀手',enemysData.聚贤庄_杀手);
    添加战斗剧情('战斗_聚贤庄_何太冲',enemysData.聚贤庄_何太冲);
    添加战斗剧情('战斗_聚贤庄_岳不群',enemysData.聚贤庄_岳不群);
    添加战斗剧情('战斗_聚贤庄_灭绝',enemysData.聚贤庄_灭绝);
    添加战斗剧情('战斗_长白山_李秋水',enemysData.长白山_李秋水);
    添加战斗剧情('战斗_长白山_童姥',enemysData.长白山_童姥);
    添加战斗剧情('战斗_昆仑_何太冲',enemysData.昆仑_何太冲);
    添加战斗剧情('战斗_昆仑_白猿',enemysData.昆仑_白猿);
    添加战斗剧情('战斗_青城_弟子',enemysData.青城_弟子);
    添加战斗剧情('战斗_青城_余沧海',enemysData.青城_余沧海);
    添加战斗剧情('战斗_论剑_匪兵',enemysData.论剑_匪兵);
    添加战斗剧情('战斗_论剑_乔峰',enemysData.论剑_乔峰);
    添加战斗剧情('战斗_论剑_东方不败',enemysData.论剑_东方不败);
    添加战斗剧情('战斗_论剑_无名僧',enemysData.论剑_无名僧);
    添加战斗剧情('战斗_论剑_神仙',enemysData.论剑_神仙);
})()
