/*
 * @Author: MngYou
 * @Date: 2022-02-10 16:05:58
 * @LastEditTime: 2022-02-10 18:48:08
 * @FilePath: \wx\script\story\story_剧情_无量山洞.js
 */

story_['剧情_无量山洞'] = [
    {
        '编号':0,
        '背景图片':0x5606000e,
        '立绘名称':[,,,,],
        '立绘图片':[,,,,],
        '序列帧动画':{
            '是否播放':false,
        },
        '对话框头像':0x56020001,
        '对话框姓名':'云行深',
        '对话框对白':'想不到这里竟然别有洞天。若非我运气上佳，可能一辈子也无法见到这洞天福地。',
    },
    {
        '编号':1,
        '背景图片':0x5606000e,
        '立绘名称':[,,,,],
        '立绘图片':[,,,,],
        '序列帧动画':{
            '是否播放':false,
        },
        '对话框头像':0x56020001,
        '对话框姓名':'云行深',
        '对话框对白':'这玉雕美女像竟然如此逼真细腻，仿佛是极具灵气的活物似的。',
    },
    {
        '编号':2,
        '背景图片':0x5606000e,
        '立绘名称':[,,,,],
        '立绘图片':[,,,,],
        '序列帧动画':{
            '是否播放':false,
        },
        '对话框头像':0x56020001,
        '对话框姓名':'云行深',
        '对话框对白':'神仙姊姊，在下今日得睹芳容，死而无憾。姊姊在此离世独居，不也太寂寞了么？',
    },
    {
        '编号':3,
        '背景图片':0x5606000e,
        '立绘名称':[,,,,],
        '立绘图片':[,,,,],
        '序列帧动画':{
            '是否播放':false,
        },
        '对话框头像':0x56020001,
        '对话框姓名':'云行深',
        '对话框对白':'神仙姊姊，你若能活过来跟我说一句话，我便为你死一千遍，一万遍，也如身登极乐，欢喜无限。',
    },
/*     {
        '编号':4,
        '背景图片':0x5606000e,
        '立绘名称':[,,,,],
        '立绘图片':[,,,,],
        '序列帧动画':{
            '是否播放':false,
        },
        '对话框头像':0x56020001,
        '对话框姓名':'云行深',
        '对话框对白':'',
        '对话框选项':[
            '1.跪拜“神仙姊姊”',
            '2.离开这里',
        ],
        '对话框跳转':[
            {'剧情名称':'剧情_无量山洞','场景索引':5},{'剧情名称':'剧情_主地图','场景索引':0}
        ],
    },
    {
        '编号':5,
        '背景图片':0x5606000e,
        '立绘名称':[,,,,],
        '立绘图片':[,,,,],
        '序列帧动画':{
            '是否播放':false,
        },
        '对话框头像':0x56020001,
        '对话框姓名':'云行深',
        '对话框对白':'1下……',
    }, */
/*     {
        '编号':1,//该场景仅作为剧情跳转中转站
        '背景图片':'',
        '立绘名称':[,,,,],
        '立绘图片':[,,,,],
        '序列帧动画':{
            '是否播放':false,
        },
        '对话框头像':'',
        '对话框姓名':'',
        '对话框对白':'',
        '跳转剧情':{
            '剧情名称':'剧情_主地图',
            '场景索引':0
        }
    }, */
];

剧情数据设置 = function(名称,索引,背景图片 = '',立绘名称 = [,,,,],立绘图片=[,,,,],序列帧动画 = {'是否播放':false,},对话框头像 = '',对话框姓名 = '',对话框对白 = '',对话框选项 = undefined,对话框跳转 = undefined){
    story_[名称][索引] = 
    {
        '编号':索引,
        '背景图片':背景图片,
        '立绘名称':立绘名称,
        '立绘图片':立绘图片,
        '序列帧动画':序列帧动画,
        '对话框头像':对话框头像,
        '对话框姓名':对话框姓名,
        '对话框对白':对话框对白,
        '对话框选项':对话框选项,
        '对话框跳转':对话框跳转
    };
}

let clickCount = 0;
for (let i = 4; i < 204; i=i+2) {
    剧情数据设置(
        '剧情_无量山洞',i,
        0x5606000e,undefined,undefined,undefined,
        0x56020001,'云行深',undefined,
        [
            '1.跪拜“神仙姊姊”',
            '2.离开这里',
        ],
        [
            {'剧情名称':'剧情_无量山洞','场景索引':i+1},{'剧情名称':'剧情_无量山洞','场景索引':220}
        ],
    );
    clickCount++;
    剧情数据设置(
        '剧情_无量山洞',i+1,
        0x5606000e,undefined,undefined,undefined,
        0x56020001,'云行深',clickCount + '下……'
    );
}

story_['剧情_无量山洞'][203].剧情线 = {
    '名称':'无量山洞剧情线',
    '标记':1
}

剧情数据设置(
    '剧情_无量山洞',204,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','我娘，磕得我头都晕了。咦？原来跪拜用的蒲团都被我磕烂了。这蒲团里面似乎有夹层，该不会藏了什么东西吧？我来看一看。'
);
//判断是否学会北冥神功||1/3的概率拿不到
剧情数据设置(
    '剧情_无量山洞',205,
    0x5606000e,undefined,undefined,undefined,'','',''
);

let r = 0;//随机数
let Index = 0;//场景索引
r = Math.random();
if(r>0.33&&r<0.66){
    Index = 206;
}else{
    Index = 213;
}
story_['剧情_无量山洞'][205].跳转剧情 = {
    '剧情名称':'剧情_无量山洞',
    '场景索引':Index
}


剧情数据设置(
    '剧情_无量山洞',206,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','晕！果然里面原来放过东西，还有一张便条：'
);
剧情数据设置(
    '剧情_无量山洞',207,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','[03]汝既磕首百遍，自当供我驱策，终身无悔。此卷为我逍遥派武功精要，每日卯午酉三时，务须用心修习一次，若稍有懈惰，余将蹙眉痛心矣。'
);
剧情数据设置(
    '剧情_无量山洞',208,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','[03]神功既成，可至琅圜福地遍阅诸般曲籍，天下各门派武功家数尽集于斯，亦即尽为汝用。勉之勉之。'
);
剧情数据设置(
    '剧情_无量山洞',209,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','[03]学成下山，为余杀尽逍遥派弟子，有一遗漏，余于天上地下耿耿长恨也。'
);
剧情数据设置(
    '剧情_无量山洞',210,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','也不知这里原来放了什么武功秘籍，这逍遥派有和这放书之人是什么关系？头都大了，还是不想了。'
);
剧情数据设置(
    '剧情_无量山洞',211,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','既然我无缘得窥绝学，还是就不要奢望了。'
);
剧情数据设置(
    '剧情_无量山洞',212,
    0x5606000e,undefined,undefined,undefined,'','',''
);
story_['剧情_无量山洞'][212].跳转剧情 = {
    '剧情名称':'剧情_主地图',
    '场景索引':0
}
//1/3的概率得不到北冥神功与凌波微步||存在北冥神功时同样拿不到

剧情数据设置(
    '剧情_无量山洞',213,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','哇！原来里面还有如此好东西，还有一张便条：'
);
story_['剧情_无量山洞'][213].获得物品 = [
    {
        '名称':'北冥神功',
        '类型':'秘籍',
        '数量':1,
    },
    {
        '名称':'凌波微步',
        '类型':'秘籍',
        '数量':1,
    },
];
剧情数据设置(
    '剧情_无量山洞',214,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','[03]汝既磕首百遍，自当供我驱策，终身无悔。此卷为我逍遥派武功精要，每日卯午酉三时，务须用心修习一次，若稍有懈惰，余将蹙眉痛心矣。'
);
剧情数据设置(
    '剧情_无量山洞',215,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','[03]神功既成，可至琅圜福地遍阅诸般曲籍，天下各门派武功家数尽集于斯，亦即尽为汝用。勉之勉之。'
);
剧情数据设置(
    '剧情_无量山洞',216,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','[03]学成下山，为余杀尽逍遥派弟子，有一遗漏，余于天上地下耿耿长恨也。'
);
剧情数据设置(
    '剧情_无量山洞',217,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','也不知这逍遥派和这放书之人是什么关系？头都大了，还是不想了。'
);
剧情数据设置(
    '剧情_无量山洞',218,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','看来我和神仙姊姊真是有缘，一定是姊姊指引我来此学成神功绝学。'
);
剧情数据设置(
    '剧情_无量山洞',219,
    0x5606000e,undefined,undefined,undefined,'','',''
);
story_['剧情_无量山洞'][219].跳转剧情 = {
    '剧情名称':'剧情_主地图',
    '场景索引':0
}


剧情数据设置(
    '剧情_无量山洞',220,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','神仙姊姊，请你保佑在下事事如意、长命百岁。'
);
剧情数据设置(
    '剧情_无量山洞',221,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','我知道你在这里一定非常寂寞，日后在下厌倦了江湖生涯，一定来此长伴神仙姊姊，隐居终老。'
);
剧情数据设置(
    '剧情_无量山洞',222,
    0x5606000e,undefined,undefined,undefined,0x56020001,'云行深','只是现有俗务缠身，不得不先行离开，望请见谅。'
);
剧情数据设置(
    '剧情_无量山洞',223,
    0x5606000e,undefined,undefined,undefined,'','',''
);
story_['剧情_无量山洞'][223].跳转剧情 = {
    '剧情名称':'剧情_主地图',
    '场景索引':0
}





story_['剧情_莽牯朱蛤'] = [];

剧情数据设置(
    '剧情_莽牯朱蛤',0,
    0x56060002,undefined,undefined,undefined,'','',''
);
story_['剧情_莽牯朱蛤'][0].播放音效 = 0x49000020;
story_['剧情_莽牯朱蛤'][0].不可跳转 = true;
story_['剧情_莽牯朱蛤'][0].延时跳转 = {
    '延时时间':1000,//100000
    '跳转剧情':{
        '剧情名称':'剧情_莽牯朱蛤',
        '场景索引':1
    }
};
剧情数据设置(
    '剧情_莽牯朱蛤',1,
    0x56060002,undefined,undefined,undefined,'','',''
);
story_['剧情_莽牯朱蛤'][0].播放音效 = 0x49000020;
story_['剧情_莽牯朱蛤'][0].不可跳转 = true;
story_['剧情_莽牯朱蛤'][0].延时跳转 = {
    '延时时间':1000,//100000
    '跳转剧情':{
        '剧情名称':'剧情_莽牯朱蛤',
        '场景索引':2
    }
};

剧情数据设置(
    '剧情_莽牯朱蛤',2,
    0x56060002,undefined,undefined,undefined,0x56020001,'云行深','这是什么声音，如此古怪？'
);
剧情数据设置(
    '剧情_莽牯朱蛤',3,
    0x56060002,undefined,undefined,undefined,0x56020018,'莽牯朱蛤','咕…咕…咕…'
);

story_['剧情_莽牯朱蛤'][3].剧情线 = {
    '名称':'无量山洞剧情线',
    '标记':2
}

剧情数据设置(
    '剧情_莽牯朱蛤',4,
    '',undefined,undefined,undefined,'','',''
);
story_['剧情_莽牯朱蛤'][4].跳转战斗 = true;
story_['剧情_莽牯朱蛤'][4].胜利时跳转 = {'剧情名称':'剧情_主地图','场景索引':0};
story_['剧情_莽牯朱蛤'][4].失败时跳转 = {'剧情名称':'剧情_主角死亡','场景索引':0};
story_['剧情_莽牯朱蛤'][4].跳转战斗名称 = '战斗_主地图_莽牯朱蛤';
story_['剧情_莽牯朱蛤'][4].移除声音 = true;
story_['剧情_莽牯朱蛤'][4].播放音效 = 0x49000010;
story_['剧情_莽牯朱蛤'][4].获得物品 = [
    {
        '名称':'莽牯朱蛤',
        '类型':'丹药',
        '数量':1,
    },
    {
        '名称':'杀孽',
        '类型':'属性',
        '数量':1,
    },
];